stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
/**
  ******************************************************************************
  * @file    stm32wb0x_hal_radio.c
  * @author  GPM WBL Application Team
  * @brief   This file provides all the Radio Driver APIs.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x_hal.h"

/** @addtogroup STM32WB0x_HAL_Driver
  * @{
  */

/** @addtogroup RADIO
  * @{
  */

/** @defgroup RADIO_Private_Constants RADIO Private Constants
  * @{
  */

#define RSSI_OFFSET 119

/* Access address used only to sense medium with HAL_RADIO_CarrierSense() */
#define FAKE_NETWORK_ID 0xAAAAAAAA

#define VALIDITY_TAG 0xFCBCECCC
#define VALIDITY_LOCATION    0x10001EF8
#define MR_TRIMMING_LOCATION 0x10001EE8

#define MR_BLE_IBIAS_TRIM_Pos         (8)
#define MR_BLE_IBIAS_TRIM_Msk         (0x0F << MR_BLE_IBIAS_TRIM_Pos)
#define MR_BLE_IPTAT_TRIM_Pos         (12)
#define MR_BLE_IPTAT_TRIM_Msk         (0x0F << MR_BLE_IPTAT_TRIM_Pos)
#define MR_BLE_VBG_TRIM_Pos           (16)
#define MR_BLE_VBG_TRIM_Msk           (0x0F << MR_BLE_VBG_TRIM_Pos)
#define MR_BLE_RXADC_DELAY_I_TRIM_Pos (20)
#define MR_BLE_RXADC_DELAY_I_TRIM_Msk (0x07 << MR_BLE_RXADC_DELAY_I_TRIM_Pos)
#define MR_BLE_RXADC_DELAY_Q_TRIM_Pos (24)
#define MR_BLE_RXADC_DELAY_Q_TRIM_Msk (0x07 << MR_BLE_RXADC_DELAY_Q_TRIM_Pos)

/* AFC Configuration */
#define AFC_DELAY_BEFORE    (0x05)
#define AFC_DELAY_AFTER     (0x05)
#define CR_GAIN_BEFORE      (0x06)
#define CR_GAIN_AFTER       (0x06)
#define CR_LR_GAIN_BEFORE   (0x05)
#define CR_LR_GAIN_AFTER    (0x05)
#define LR_RSSI_THR         (0x1D)
#define LR_PD_THR           (0x59)
#define LR_AAC_THR          (0x32)

/* Fine tuning values for antenna switching and IQ samplig */
#define RX_TIME_TO_SAMPLE   (0x1F)
#define RX_TIME_TO_SWITCH   (0x09)

/** @defgroup Sequencer_timeouts Sequencer Timeouts
  * @{
  */

/* initDelay */
#define INITDELAY_WAKEUP          (0x40U)
#define INITDELAY_TIMER12_CAL     (0x3FU)
#define INITDELAY_TIMER2_NOCAL    (0x9U)

/* Init_radio_delay */
#if defined (STM32WB05) || defined(STM32WB09 )
#define DELAYCHK_TRANSMIT_CAL     (0x5AU)
#define DELAYCHK_TRANSMIT_NOCAL   (0x32U)
#define DELAYCHK_RECEIVE_CAL      (0x5AU)
#define DELAYCHK_RECEIVE_NOCAL    (0x32U)
#endif
#if defined (STM32WB06) || defined (STM32WB07)
#define DELAYCHK_TRANSMIT_CAL     (0x76U)
#define DELAYCHK_TRANSMIT_NOCAL   (0x3AU)
#define DELAYCHK_RECEIVE_CAL      (0x74U)
#define DELAYCHK_RECEIVE_NOCAL    (0x38U)
#endif

/* ConfigEndDuration */
#define CONFIG_END_DURATION       (0x14U)

/* DataInit phase start */
#define CHECK_TXDATAREADY         (0x5U)

/* TX parameters init */
#if defined (STM32WB05) || defined(STM32WB09 )
#define TXREADY_TIMEOUT          (0x4U)
#endif
#if defined (STM32WB06) || defined(STM32WB07)
#define TXREADY_TIMEOUT          (0x5U)
#endif
#define TXDELAY_START            (0x10U)
#define TXDELAY_END              (0x10U)

/* RX parameter init */
#define RCV_TIMEOUT              (0x100)

/* Number of state machine used */
#define STATEMACHINE_COUNT   (CFG_NUM_RADIO_TASKS)
/**
  * @}
  */

/**
  * @}
  */


/** @defgroup RADIO_Private_Macros RADIO Private Macros
  * @{
  */
#define IS_STATE_VALID(STATEMACHINE_NO) (STATEMACHINE_NO < STATEMACHINE_COUNT)
#define IS_POWERLEVEL_VALID(POWER) (POWER < 0x20)
#define IS_RFCHANNEL_VALID(RF_CHANNEL) (RF_CHANNEL <40)
#define IS_FREQOFFSET_VALID(FREQ_OFFSET) (FREQ_OFFSET >2)
#define IS_PHY_VALID(PHY) (PHY==PHY_1M || PHY==PHY_2M || PHY==PHY_CODED_S_2 || PHY==PHY_CODED_S_8)
#define IS_PREALEN_VALID(PREA) (PREA < 16)


#define MASK_INTERRUPTS() __disable_irq();
#define UNMASK_INTERRUPTS() __enable_irq();


#define TIME_DIFF(a, b)       ((int32_t)(a - b))
/**
  * @}
  */

/** @defgroup RADIO_Private_Variables RADIO Private Variables
  * @{
  */

#if USE_RADIO_PROPRIETARY_DRIVER

RadioGlobalParameters_t globalParameters;

static ActionPacket aPacket[2];
static uint32_t networkID = 0x88DF88DF;

#endif /* USE_RADIO_PROPRIETARY_DRIVER */

/**
  * @}
  */

/** @defgroup RADIO_Private_Functions RADIO Private Functions
  * @{
  */

#if USE_RADIO_PROPRIETARY_DRIVER

static uint8_t CondRoutineTrue(ActionPacket *p)
{
  return TRUE;
}

static uint8_t DataRoutineNull(ActionPacket *current_action_packet, ActionPacket *next)
{
  return TRUE;
}

static uint8_t CondRoutineRxTrue(ActionPacket *p)
{
  /* received a packet */
  if ((p->status & BLUE_INTERRUPT1REG_RCVOK) != 0)
  {
    /* packet received without CRC error */
    return TRUE;
  }
  return FALSE;
}

#endif /* USE_RADIO_PROPRIETARY_DRIVER */


/**
  * @}
  */

/** @defgroup RADIO_Global_Variables RADIO Global Variables
  * @{
  */

/* ------------------------------------------------------------------------------
*  volatile uint32_t hot_table_radio_config_u32[]
*
*  Hot table radio configuration storage.
*  This variable is only used during the smart power management
*  procedure
*  ------------------------------------------------------------------------------ */
/* Round up HOT_TABLE_SIZE to an integer number of words then add 4 words for table management pointers */
volatile uint32_t hot_table_radio_config_u32[((HOT_TABLE_SIZE + 3) >> 2) + 4] = {0x00};

/* BLUE RAM, reserved for radio communication. Not usable from the application */
__SECTION(".bss.__blue_RAM")
__REQUIRED(uint8_t __blue_RAM[CFG_NUM_RADIO_TASKS * sizeof(STATMACH_TypeDef) + sizeof(GLOBALSTATMACH_TypeDef)]) = {0,};

/**
  * @}
  */

/** @defgroup RADIO_Exported_Functions RADIO Exported Functions
  * @{
  */

/**
  * @brief  Initializes the radio.
  * @retval None
  */
void HAL_RADIO_Init(RADIO_HandleTypeDef *hradio)
{
  uint32_t mr_ble_ibias;
  uint32_t mr_ble_iptat;
  uint32_t mr_ble_vbg;
  uint32_t mr_ble_rxadc_delay_i;
  uint32_t mr_ble_rxadc_delay_q;
  uint8_t mr_ble_rxadc_delay_flag;
  uint8_t *hot_table_radio_config = (uint8_t *)&hot_table_radio_config_u32[4];
  uint8_t index;

  /* Retrieve Trimming values from engineering flash locations */
  if (*(volatile uint32_t *)VALIDITY_LOCATION == VALIDITY_TAG)
  {
    mr_ble_ibias            = ((*(volatile uint32_t *)MR_TRIMMING_LOCATION) & MR_BLE_IBIAS_TRIM_Msk) >> MR_BLE_IBIAS_TRIM_Pos;
    mr_ble_iptat            = ((*(volatile uint32_t *)MR_TRIMMING_LOCATION) & MR_BLE_IPTAT_TRIM_Msk) >> MR_BLE_IPTAT_TRIM_Pos;
    mr_ble_vbg              = ((*(volatile uint32_t *)MR_TRIMMING_LOCATION) & MR_BLE_VBG_TRIM_Msk) >> MR_BLE_VBG_TRIM_Pos;
    mr_ble_rxadc_delay_i    = ((*(volatile uint32_t *)MR_TRIMMING_LOCATION) & MR_BLE_RXADC_DELAY_I_TRIM_Msk) >> MR_BLE_RXADC_DELAY_I_TRIM_Pos;
    mr_ble_rxadc_delay_q    = ((*(volatile uint32_t *)MR_TRIMMING_LOCATION) & MR_BLE_RXADC_DELAY_Q_TRIM_Msk) >> MR_BLE_RXADC_DELAY_Q_TRIM_Pos;
    mr_ble_rxadc_delay_flag = TRUE;
  }
  else
  {
    mr_ble_ibias = 0x08;
    mr_ble_iptat = 0x07;
    mr_ble_vbg   = 0x08;
    mr_ble_rxadc_delay_flag = FALSE;
#if defined(STM32WB05) || defined(STM32WB09)
    mr_ble_rxadc_delay_i    = 3;
    mr_ble_rxadc_delay_q    = 3;
    mr_ble_rxadc_delay_flag = TRUE;
#endif /* STM32WB05 or STM32WB09 */
  }

  BLUEGLOB->BYTE4 = BLUE_IDLE_0;
  if (hradio != NULL)
  {
    HAL_RADIO_MspInit(hradio);
  }
  LL_RADIO_TIMER_DisableTimer1(BLUE);
  LL_RADIO_TIMER_DisableTimer2(BLUE);
  LL_RADIO_TIMER_DisableBLEWakeupTimer(WAKEUP);

