stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
  /* If the device is configured with
     System clock = 64 MHz and BLE clock = 16 MHz
     a register read is necessary to end fine
     the clear interrupt register operation,
     due the AHB down converter latency */
  int_val_tmp = BLUE->INTERRUPT1REG;

  return;
}

/**
  * @brief  Read RSSI
  * @retval int8_t: RSSI in dBm
  */
int8_t HAL_RADIO_ReadRSSI(void)
{
  int32_t rssi_dbm;
  uint32_t rssi0 = RRM->RSSI0_DIG_OUT;
  uint32_t rssi1 = RRM->RSSI1_DIG_OUT;

  uint32_t rssi_int16 = ((rssi1 & 0xFF) << 8) | (rssi0 & 0xFF);
  uint32_t reg_agc = RRM->AGC_DIG_OUT;

  if ((rssi_int16 == 0U) || (reg_agc > 0xbU))
  {
    rssi_dbm = 127 ;
  }
  else
  {
    rssi_dbm = (int32_t)reg_agc * 6 - RSSI_OFFSET;//127 ;
    while (rssi_int16 > 30U)
    {
      rssi_dbm = rssi_dbm + 6 ;
      rssi_int16 = (rssi_int16 >> 1) ;
    }
    rssi_dbm = rssi_dbm + (int32_t)(uint32_t)((417U * rssi_int16 + 18080U) >> 10);
  }
  return (int8_t)rssi_dbm;
}

#if USE_RADIO_PROPRIETARY_DRIVER

/**
  * @brief  This routine is called when a RADIO event is complete.
  * @param  p: Current action packet which its transaction has been completed.
  * @param  next: Next action packet which is going to be scheduled.
  * @retval return value: TRUE
  */
uint8_t HAL_RADIO_Callback(ActionPacket *p, ActionPacket *next)
{
  /* Event is a reception */
  if ((p->status & BLUE_STATUSREG_PREVTRANSMIT) == 0)
  {
    RxStats_t receivedStats = {0};
    /* Reception ends with no errors */
    if ((p->status & BLUE_INTERRUPT1REG_RCVOK) != 0)
    {
      if ((p->status & BLUE_INTERRUPT1REG_ENCERROR) != 0)
      {
        receivedStats.rssi = p->rssi;
        receivedStats.timestamp_receive = p->timestamp_receive;
        HAL_RADIO_CallbackRcvEncryptErr(&receivedStats);
      }
      else
      {
        receivedStats.rssi = p->rssi;
        receivedStats.timestamp_receive = p->timestamp_receive;
        HAL_RADIO_CallbackRcvOk(&receivedStats);
      }
    }
    /* Reception ends with timeout */
    else if ((p->status & BLUE_INTERRUPT1REG_RCVTIMEOUT) != 0)
    {
      receivedStats.rssi = p->rssi;
      receivedStats.timestamp_receive = 0;
      HAL_RADIO_CallbackRcvTimeout(&receivedStats);
    }
    /* Reception ends with errors */
    else if ((p->status & BLUE_INTERRUPT1REG_RCVCRCERR) != 0)
    {
      receivedStats.rssi = p->rssi;
      receivedStats.timestamp_receive = p->timestamp_receive;
      HAL_RADIO_CallbackRcvError(&receivedStats);
    }
  }
  /* Event is a transmission */
  else if ((p->status & BLUE_INTERRUPT1REG_DONE) != 0)
  {
    /* RADIO TX operation done */
    HAL_RADIO_CallbackTxDone();
  }
  return TRUE;
}

__weak void HAL_RADIO_CallbackRcvError(RxStats_t *rxPacketStats) {}
__weak void HAL_RADIO_CallbackRcvTimeout(RxStats_t *rxPacketStats) {}
__weak void HAL_RADIO_CallbackRcvEncryptErr(RxStats_t *rxPacketStats) {}
__weak void HAL_RADIO_CallbackRcvOk(RxStats_t *rxPacketStats) {}
__weak void HAL_RADIO_CallbackTxDone(void) {}

/**
  * @brief  Radio ISR.
  *         Besides, next packet is scheduled here.
  * @retval None
  */
static void HAL_RADIO_ActionPacketIsr(uint32_t int_flags)
{
  if ((int_flags & BLUE_INTERRUPT1REG_DONE) != 0)
  {

    ActionPacket *next, *actionPacketBackup;
    BlueTransStruct *p;
    uint32_t time;

    /* Copy status in order for callback to access it. */
    globalParameters.current_action_packet->status = int_flags | \
                                                     (BLUE->STATUSREG & BLUE_STATUSREG_PREVTRANSMIT_Msk);

    if ((globalParameters.current_action_packet->condRoutine(globalParameters.current_action_packet)) == TRUE)
    {
      next = globalParameters.current_action_packet->next_true;
    }
    else
    {
      next = globalParameters.current_action_packet->next_false;
    }
    /*The radio event is started. So here a check on the next packet of the event is made*/
    if (next == NULL_0)
    {
      /* timer2 off */
      LL_RADIO_TIMER_DisableTimer1(BLUE);
      LL_RADIO_TIMER_DisableTimer2(BLUE);
      LL_RADIO_TIMER_DisableBLEWakeupTimer(WAKEUP);
      MODIFY_REG(BLUEGLOB->BYTE4, GLOBAL_BYTE4_ACTIVE_Msk, BLUE_IDLE_0);
      HAL_RADIO_TIMER_ClearRadioTimerValue();
    }
    else
    {
      BLUEGLOB->BYTE4 = (next->StateMachineNo | GLOBAL_BYTE4_ACTIVE_Msk);
      p = &next->trans_packet;
      MODIFY_REG((bluedata + next->StateMachineNo)->BYTE0, STATEMACH_BYTE0_TXMODE_Msk,
                 next->trans_config);/* Transmission or reception*/
      (bluedata + next->StateMachineNo)->TXPOINT = BLUE_STRUCT_PTR_CAST(p);
      (bluedata + next->StateMachineNo)->RCVPOINT = BLUE_STRUCT_PTR_CAST(p);
      (bluedata + next->StateMachineNo)->MAXRECEIVEDLENGTH = next->MaxReceiveLength;

      /* Packet will execute on time specified by WakeupTime */
      if ((next->ActionTag & TIMER_WAKEUP) != 0)
      {
        /* timer1/2 off */
        LL_RADIO_TIMER_DisableTimer1(BLUE);
        LL_RADIO_TIMER_DisableTimer2(BLUE);

        /* program timer at next->wakeuptime */
        if ((next->ActionTag & RELATIVE) != 0)
        {
          time = HAL_RADIO_TIMER_GetCurrentSysTime() + HAL_RADIO_TIMER_UsToSystime(next->WakeupTime);
          HAL_RADIO_TIMER_SetRadioTimerValue(time, (next->trans_config == STATEMACH_BYTE0_TXMODE_Msk), (next->ActionTag & PLL_TRIG));
        }
        else
        {
          HAL_RADIO_TIMER_SetRadioTimerValue(next->WakeupTime, (next->trans_config == STATEMACH_BYTE0_TXMODE_Msk), (next->ActionTag & PLL_TRIG));
        }
      }
      else
      {
        /* back to back */
      }
    }

    /* Accept the packet even with CRC Error */
    if (((int_flags & BLUE_INTERRUPT1REG_RCVOK) != 0) || ((int_flags & BLUE_INTERRUPT1REG_RCVCRCERR) != 0))
    {

      uint64_t current_system_time;
      /* read RSSI */
      globalParameters.current_action_packet->rssi =  HAL_RADIO_ReadRSSI();

      /* bluedata->config = bluedata->config ^ 0x80 ;  toggle NESN bit
      bluedata->config = bluedata->config & 0x7F ;  //reset NESN bit */

      /* read time stamp */
      globalParameters.current_action_packet->timestamp_receive = HAL_RADIO_TIMER_GetAnchorPoint(&current_system_time);
    }
    else if ((int_flags & BLUE_INTERRUPT1REG_RCVTIMEOUT) != 0)
    {
      /* read RSSI even if a timeout happens */
      globalParameters.current_action_packet->rssi =  HAL_RADIO_ReadRSSI();
    }

    actionPacketBackup = globalParameters.current_action_packet;
    globalParameters.current_action_packet = next;
    actionPacketBackup->dataRoutine(actionPacketBackup, next);
  }

  return ;
}

/**
  * @brief  This routine force the radio to be stopped. After calling this function,
  *         the ISR is not triggered unless, "MakeActionPacketPending" API called again.
  * @retval 0 if the radio activity has been cleared successfully.
  * @retval 1 if it is too late to clear the last radio activity.
  * @retval 2 if it might not be possible to clear the last radio activity.
  */
uint8_t HAL_RADIO_StopActivity(void)
{
  uint8_t retval;
  MASK_INTERRUPTS();
  MODIFY_REG(BLUEGLOB->BYTE4, GLOBAL_BYTE4_ACTIVE_Msk, BLUE_IDLE_0);
  retval = HAL_RADIO_TIMER_ClearRadioTimerValue();
  globalParameters.current_action_packet = 0;
  UNMASK_INTERRUPTS();
  return retval;
}

/**
  * @brief  This routine sets the channel map. If channel map is not in use, do not use it. The
  *         chan_remap constant is a 37-bit vector, one bit per channel from 0 to 36, with the
  *         LSB corresponding to the channel 0. If the corresponding bit is set, the channel is in use; if it is cleared,
  *         there is an automatic remap to another channel, as defined in the Bluetooth Low
  *         Energy specification.
  *         Setting all bits of the array to one, disables the channel remapping, and this is the mode
  *         that should be used if the Bluetooth channel remap is not in use.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  chan_remap: a 37-bit vector, one bit per channel from 0 to 36, with the LSB corresponding to the channel 0
  * @retval None
  */
void HAL_RADIO_SetChannelMap(uint8_t StateMachineNo, uint8_t *chan_remap)
{
  /* Check the parameters */
  assert_param(IS_STATE_VALID(StateMachineNo));

  for (uint8_t i = 0; i < 5; i++)
  {
    (bluedata + StateMachineNo)->USEDCHANNELFLAGS[i] = chan_remap[i];
  }
  (bluedata + StateMachineNo)->USEDCHANNELFLAGS[4] &= 0x1F;
  return;
}

/**
  * @brief  This routine sets the channel and the channel increment. Channel and channel
  *         increment follows channel mapping corresponding to Bluetooth specification.
  *         RF channel 0:  2402 MHz -> ble channel index 37
  *         RF channel 1:  2404 MHz -> ble channel index 0
  *         RF channel 2:  2406 MHz -> ble channel index 1
  *         ...
  *         RF channel 11: 2424 MHz -> ble channel index 10
  *         RF channel 12: 2426 MHz -> ble channel index 38
  *         RF channel 13: 2428 MHz -> ble channel index 11
  *         RF channel 14: 2430 MHz -> ble channel index 12
  *         ...
  *         RF channel 38: 2478 MHz -> ble channel index 36
  *         RF channel 39: 2480 MHz -> ble channel index 39
  *
  *         For the ble channel index 37, 38 and 39 (RF channel 0, 12, 39):
  *          - The crc_init value should always be 0x555555.
  *          - There is no encryption.
  *          - The channel increment is dedicated, the channel sequence is:
  *            37 -> 38 -> 39 -> 37 -> ... while for the other channels is:
  *            0 -> 1 -> ... -> 36 -> 0 -> ...
  *            There is no channel map for these three channels.
  *            Valid values for packet length for these channels are from 6 to 37.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  channel: ble channel index. From 0 to 39.
  * @param  channel_increment: determines the hoping value.
  * @retval None
  */
void HAL_RADIO_SetChannel(uint8_t StateMachineNo, uint8_t channel, uint8_t channel_increment)
{
  /* Check the parameters */
  assert_param(IS_STATE_VALID(StateMachineNo));
  assert_param(IS_RFCHANNEL_VALID(channel));

  MODIFY_REG((bluedata + StateMachineNo)->BYTE0, STATEMACH_BYTE0_UCHAN_Msk, channel);
  /*if TxRxPack.incchan = 0, then remap_chan is used as physical channel*/
  MODIFY_REG((bluedata + StateMachineNo)->BYTE1, STATEMACH_BYTE1_REMAP_CHAN_Msk, channel);
  (bluedata + StateMachineNo)->HOPINCR = channel_increment;
  return;
}

/**
  * @brief  This routine sets the NetworkID and the CRC init.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  NetworkID: The NetworkID is the ID of the device.
  *         The user shall ensure that the NetworkID meets the following requirements:
  *           - It shall have no more than six consecutive zeros or ones.
  *           - It shall not have all four octets equal.
  *           - It shall have no more than 24 transitions.
  *           - It shall have a minimum of two transitions in the most significant six bits.
  * @param  crc_init: CRC initialization value.
  *         This value must be 0x555555 when channel frequency is one of these values: 37, 38, 39.
  * @retval None
  */
void HAL_RADIO_SetTxAttributes(uint8_t StateMachineNo, uint32_t NetworkID, uint32_t crc_init)
{
  /* Check the parameters */
  assert_param(IS_STATE_VALID(StateMachineNo));

