stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
  (bluedata + StateMachineNo)->ACCADDR = NetworkID;
  (bluedata + StateMachineNo)->CRCINIT[0] = crc_init;
  (bluedata + StateMachineNo)->CRCINIT[1] = crc_init >> 8;
  (bluedata + StateMachineNo)->CRCINIT[2] = crc_init >> 16;
  return;
}

/**
  * @brief  This routine sets the 40-bit receive and transmit packet count, to be used in
  *         encryption calculation.
  *         Both are pointers to char, and set the 39-bit counter + 1-bit MSB as defined in the
  *         Bluetooth Low Energy spec. One is for transmit packets, the other is for receive packets.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  count_tx: 40-bit transmit packet count, to be used in encryption nounce calculation.
  * @param  count_rcv: 40-bit receive packet count, to be used in encryption nounce calculation.
  * @retval None
  */
void HAL_RADIO_SetEncryptionCount(uint8_t StateMachineNo, uint8_t *count_tx, uint8_t *count_rcv)
{
  /* Check the parameters */
  assert_param(IS_STATE_VALID(StateMachineNo));

  for (uint8_t i = 0; i < 5; i++)
  {
    (bluedata + StateMachineNo)->PCNTRCV[i] = count_rcv[i];
    (bluedata + StateMachineNo)->PCNTTX[i] = count_tx[i];
  }
  return;
}

/**
  * @brief  This routines sets the 8-byte encryption initial vector, and the 16-byte encryption key.
  *         The definition of the encryption key and its initial value is according the Bluetooth Low Energy spec.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  enc_iv: 8-byte encryption initial vector.
  * @param  enc_key: 16-byte encryption key.
  * @retval None
  */
void HAL_RADIO_SetEncryptionAttributes(uint8_t StateMachineNo, uint8_t *enc_iv, uint8_t *enc_key)
{
  uint8_t i = 0;
  /* Check the parameters */
  assert_param(IS_STATE_VALID(StateMachineNo));

  for (i = 0; i < 8; i++)
  {
    (bluedata + StateMachineNo)->ENCRYPTIV[i] = enc_iv[i];
    (bluedata + StateMachineNo)->ENCRYPTK[i] = enc_key[i];
  }
  for (i = 8; i < 16; i++)
  {
    (bluedata + StateMachineNo)->ENCRYPTK[i] = enc_key[i];
  }

  return;
}

/**
  * @brief  Set the maximum length of a received packet.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  MaxReceivedLength: Upper limit for the length of a received packet.
  *                            From 0 to 255 bytes.
  * @retval None
  */
void HAL_RADIO_SetMaxReceivedLength(uint8_t StateMachineNo, uint8_t MaxReceivedLength)
{
  (bluedata + StateMachineNo)->MAXRECEIVEDLENGTH = MaxReceivedLength;
  return;
}

/**
  * @brief  Initializes the time between back-to-back radio transmissions.
  * @param  back_to_back_time: time between two packets if wakeupTimer is not used. Resolution is 1 us.
  * @retval None
  */
void HAL_RADIO_SetBackToBackTime(uint32_t back_to_back_time)
{
  globalParameters.back2backTime = back_to_back_time;
  return;
}


/**
  * @brief Phy selection
  * @param  StateMachineNo: state machine number in multi state.
  * @param  phy:
  *         0x0  PHY is not coded 1Mbps
  *         0x1  PHY is not coded 2Mbps
  *         0x4  PHY is coded 1Mbps with S=8
  *         0x6  PHY is coded 1Mbps with S=2
  * @retval None
  */
void HAL_RADIO_SetPhy(uint8_t StateMachineNo, uint8_t phy)
{
  assert_param(IS_PHY_VALID(phy));

  MODIFY_REG((bluedata + StateMachineNo)->BYTE3, STATEMACH_BYTE3_TXPHY_Msk, phy);
  MODIFY_REG((bluedata + StateMachineNo)->BYTE3, STATEMACH_BYTE3_RXPHY_Msk, phy << 4);

  return;
}

/**
  * @brief  This routine turns encrypt ON and OFF. When the encryption is enabled, the hardware will add 4 bytes
  *         at the end of the packet as MIC (Message Authentication Code). So the user need to add 4 byte to the
  *         length of the packet. The parameters enable the encryption for both. There are two separated parameters
  *         for this function just compliance with previous version of the driver.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  EncryptFlagTx: DISABLE: encryption is turned OFF for both TX and RX operations.
  *              ENABLE: encryption is turned OFF for both TX and RX operations.
  *         This parameter can be: ENABLE or DISABLE.
  * @param  EncryptFlagRcv: encryption is turned OFF for both TX and RX operations.
  *              ENABLE: encryption is turned OFF for both TX and RX operations.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void HAL_RADIO_SetEncryptFlags(uint8_t StateMachineNo, FunctionalState EncryptFlagTx, FunctionalState EncryptFlagRcv)
{
  /* Check the parameters */
  assert_param(IS_STATE_VALID(StateMachineNo));
  assert_param(IS_FUNCTIONAL_STATE(EncryptFlagTx));
  assert_param(IS_FUNCTIONAL_STATE(EncryptFlagRcv));

  if (EncryptFlagTx == ENABLE || EncryptFlagRcv == ENABLE)
  {
    (bluedata + StateMachineNo)->BYTE2 |= STATEMACH_BYTE2_ENCRYPTON_Msk;
    (bluedata + StateMachineNo)->BYTE35 |= STATEMACH_BYTE35_INTENCERROR_Msk;
  }
  else
  {
    (bluedata + StateMachineNo)->BYTE2 &= (~STATEMACH_BYTE2_ENCRYPTON_Msk);
  }
  (bluedata + StateMachineNo)->BYTE35 |= STATEMACH_BYTE35_INTRXOVERFLOWERROR_Msk;
  return;
}

/**
  * @brief  Set the receive window length.
  *         Define the maximum duration to stay in reception without any preamble
  *         and access address detection.
  * @param  ReceiveTimeout: receive window length in microseconds.
  * @retval None
  */
void HAL_RADIO_SetGlobalReceiveTimeout(uint32_t ReceiveTimeout)
{
  /* Set the Rx window Timeout expressed as: 4^(RCVTIMEOUT_19_18)*RCVTIMEOUT_17_0 */
  if (ReceiveTimeout < 0x40000)
  {
    BLUEGLOB->RCVTIMEOUT[0] = (ReceiveTimeout)       & 0x000000FF;
    BLUEGLOB->RCVTIMEOUT[1] = (ReceiveTimeout >> 8)  & 0x000000FF;
    BLUEGLOB->RCVTIMEOUT[2] = (ReceiveTimeout >> 16) & 0x00000003;
  }
  else if (ReceiveTimeout < 0x100000)
  {
    BLUEGLOB->RCVTIMEOUT[0] = (ReceiveTimeout >> 2)  & 0x000000FF;
    BLUEGLOB->RCVTIMEOUT[1] = (ReceiveTimeout >> 10) & 0x000000FF;
    BLUEGLOB->RCVTIMEOUT[2] = (ReceiveTimeout >> 18) & 0x00000003;

    BLUEGLOB->RCVTIMEOUT[2] |= 0x04;
  }
  else if (ReceiveTimeout < 0x400000)
  {
    BLUEGLOB->RCVTIMEOUT[0] = (ReceiveTimeout >> 4)  & 0x000000FF;
    BLUEGLOB->RCVTIMEOUT[1] = (ReceiveTimeout >> 12) & 0x000000FF;
    BLUEGLOB->RCVTIMEOUT[2] = (ReceiveTimeout >> 20) & 0x00000003;

