stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
    BLUEGLOB->RCVTIMEOUT[2] |= 0x08;
  }
  else if (ReceiveTimeout < 0x1000000)
  {
    BLUEGLOB->RCVTIMEOUT[0] = (ReceiveTimeout >> 6)  & 0x000000FF ;
    BLUEGLOB->RCVTIMEOUT[1] = (ReceiveTimeout >> 14) & 0x000000FF ;
    BLUEGLOB->RCVTIMEOUT[2] = (ReceiveTimeout >> 22) & 0x00000003 ;

    BLUEGLOB->RCVTIMEOUT[2] |= 0x0C;
  }
  else
  {
    /* error */
  }
}

/**
  * @brief  This routine should be called after writing/modifying an action packet, and before it
  *         is executed via either the API mechanism, or the next mechanism.
  * @param  p: pointer to action packet.
  * @retval None
  */
void HAL_RADIO_SetReservedArea(ActionPacket *p)
{
  uint32_t relTimeout;
  uint32_t cnt;

  /*Init to 0 the TxRxPack*/
  for (cnt = 0; cnt < sizeof(p->trans_packet); cnt++)
  {
    ((uint8_t *)(&(p->trans_packet)))[cnt] = 0;
  }

  /*Set the TxRxPack for the next transaction. The list cannot be empty.
  At least,it can be composed by one only packet that points to itself*/
  p->trans_packet.NEXTPTR = BLUE_STRUCT_PTR_CAST(&(p->trans_packet));

  /* Set the buffer that contains the values to send or that stores
  the data received */
  p->trans_packet.DATAPTR = BLUE_DATA_PTR_CAST(p->data);

  /* Compensate the radio setup time from the back2back time */
  relTimeout = globalParameters.back2backTime - 70;

  /*Check if there is some action to perform next*/
//  if (p->next_false || p->next_true){ /* Host timer workaround */
  /* Set the Timeout for the Timer2 */
  p->trans_packet.TIMER2[0] = relTimeout & 0xFF;
  p->trans_packet.TIMER2[1] = (relTimeout >> 8) & 0xFF;
  p->trans_packet.BYTE14 = (relTimeout >> 16) & TXRXPACK_BYTE14_TIMER2_19_16_Msk;
  /*Enable relative timer*/
  p->trans_packet.BYTE14 |= TXRXPACK_BYTE14_TIMER2EN_Msk;
//  }

  /* TrigDone or TrigReceive */
  if ((p->ActionTag & TIMESTAMP_POSITION) == 0)
  {
    p->trans_packet.BYTE14 |= TIMESTAMP_POSITION_LASTBIT;
  }
  else
  {
    p->trans_packet.BYTE14 |= TIMESTAMP_POSITION_ACCESSADDRESS;
  }

  p->trans_packet.BYTE4 |= TXRXPACK_BYTE4_KEEPSEMAREQ_Msk | \
                           (p->ActionTag & INC_CHAN) | \
                           (p->ActionTag & PLL_TRIG);

  p->trans_packet.BYTE5 |= (p->ActionTag & WHITENING_DISABLE) | \
                           TXRXPACK_BYTE5_TXDATAREADY_Msk | \
                           TXRXPACK_BYTE5_ALLTABLEREADY_Msk;

  /* Enable all interrupts */
  p->trans_packet.BYTE15 = TXRXPACK_BYTE15_INT_EN_Msk;

  /* By Default the next action is considered as next_true */
  if ((p->next_true->ActionTag & TXRX) != 0)
  {
    /* Set the type of the next activity */
    p->trans_packet.BYTE5 |= TXRXPACK_BYTE5_NEXTTXMODE_Msk;
  }

  p->trans_config = 0; // Rx
  if ((p->ActionTag & TXRX) != 0)
  {
    p->trans_config = STATEMACH_BYTE0_TXMODE_Msk; // Tx
  }
  return ;
}


/**
  * @brief  This routine should be called for the first actionPacket that needs to be scheduled
  *         on the radio. For it to work OK, the WakeupTime should be valid.
  *         Subsequent packets can be dispatched using the same process, or by providing non-NULL pointers
  *         to the next_true and next_false pointers of the ActionPacket.
  * @param  p: pointer to action packet.
  * @retval uint8_t with following values:
  *          - 0x00 : Success.
  *          - 0xC4 : Radio is busy, action packet has not been executed.
  */
uint8_t HAL_RADIO_MakeActionPacketPending(ActionPacket *p)
{
  uint8_t returnValue = SUCCESS_0;
  uint32_t time;
  uint32_t dummyTime;
  if (HAL_RADIO_GetStatus(&dummyTime) == BLUE_IDLE_0)
  {
    uint8_t  statemachineNo;
    BlueTransStruct *p1 ;

    /* timer1/2 off */
    LL_RADIO_TIMER_DisableTimer1(BLUE);
    LL_RADIO_TIMER_DisableTimer2(BLUE);

    statemachineNo = 0x7F & p->StateMachineNo;

    BLUEGLOB->BYTE4 = (p->StateMachineNo | GLOBAL_BYTE4_ACTIVE_Msk);

    p1 = &p->trans_packet;
    (bluedata + statemachineNo)->RCVPOINT = BLUE_STRUCT_PTR_CAST(p1);
    (bluedata + statemachineNo)->TXPOINT = BLUE_STRUCT_PTR_CAST(p1);
    (bluedata + statemachineNo)->MAXRECEIVEDLENGTH = p->MaxReceiveLength;

#if defined (STM32WB05) || defined(STM32WB09 )
    (bluedata + statemachineNo)->BYTE3 |= 1 << 3;
#endif

    globalParameters.current_action_packet = p;

    MODIFY_REG((bluedata + statemachineNo)->BYTE0, STATEMACH_BYTE0_TXMODE_Msk,
               p->trans_config); /* Transmission or reception */

    /* program timer at next->wakeuptime */
    MASK_INTERRUPTS();
    if ((p->ActionTag & RELATIVE) != 0)
    {
      time = HAL_RADIO_TIMER_GetCurrentSysTime() + HAL_RADIO_TIMER_UsToSystime(p->WakeupTime);
      returnValue = HAL_RADIO_TIMER_SetRadioTimerValue(time, (p->trans_config == STATEMACH_BYTE0_TXMODE_Msk), (p->ActionTag & PLL_TRIG));
    }
    else /*absolute time*/
    {
      returnValue = HAL_RADIO_TIMER_SetRadioTimerValue(p->WakeupTime, (p->trans_config == STATEMACH_BYTE0_TXMODE_Msk), (p->ActionTag & PLL_TRIG));
    }

    UNMASK_INTERRUPTS();
  }
  else
  {
    returnValue = RADIO_BUSY_C4;
  }
  return returnValue;
}

/**
  * @brief  Get the status of the radio and if it is active
  *         the last programmed value in MTU.
  * @param  time: where to store the last value programmed.
  * @retval 0 if the radio controller is IDLE or no timer has been programmed
  * @retval 1 if the radio is ACTIVE and a radio timer has been programmed
  */
uint8_t HAL_RADIO_GetStatus(uint32_t *time)
{
  uint8_t retValue = BLUE_IDLE_0;
  if ((BLUEGLOB->BYTE4 & GLOBAL_BYTE4_ACTIVE_Msk) != 0)
  {
    retValue = HAL_RADIO_TIMER_GetRadioTimerValue(time);
  }
  return retValue;
}

/**
  * @brief  Configures the transmit power level.
  * @param  PowerLevel: power level which should set to this value.
  *         See the documentation inside the datasheet.
  * @retval None
  */
void HAL_RADIO_SetTxPower(uint8_t PowerLevel)
{
  /* Check the parameters */
  assert_param(IS_POWERLEVEL_VALID(PowerLevel));

  for (uint8_t n = 0; n < STATEMACHINE_COUNT ; n++)
  {
    (bluedata + n)->PAPOWER = PowerLevel;
  }
  return;
}


/**
  * @brief  Restore default preamble length to one byte.
  * @param  StateMachineNo: state machine number in multi state.
  * @retval None
  */
void HAL_RADIO_SetDefaultPreambleLen(uint8_t StateMachineNo)
{
  (bluedata + StateMachineNo)->BYTE34 &= ~(STATEMACH_BYTE34_ENAPREAMBLEREP_Msk);
  return;
}

/**
  * @brief  Set how many times repeat the preamble.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  PreaLen: preamble length in byte for coded or uncoded phy.
  * @retval None
  */
void HAL_RADIO_SetPreambleRep(uint8_t StateMachineNo, uint8_t PreaLen)
{
  /* Check the parameters */
  assert_param(IS_PREALEN_VALID(PreaLen));

  (bluedata + StateMachineNo)->BYTE34 |= STATEMACH_BYTE34_ENAPREAMBLEREP_Msk;
  (bluedata + StateMachineNo)->BYTE34 |= (PreaLen & STATEMACH_BYTE34_PREAMBLEREP_Msk);
  return;
}

/**
  * @brief  Enable or disable the CRC hardware functionality.
  * By default the CRC hardware feature is enabled. So, it can be enabled again
  * if it has been disabled.
  * If disabled, the CRC will be neither checked in reception nor appended in transmission.
  * @warning ALPHA version. In reception just ignore the CRC error and don't use this feature.
  * @param  StateMachineNo: state machine number in multi state.
  * @param  hwCRC:
  *         - ENABLE: enable the CRC hardware feature.
  *         - DISABLE: disable the CRC hardware feature.
  * @retval None
  */
void HAL_RADIO_DisableCRC(uint8_t StateMachineNo, FunctionalState hwCRC)
{
  if (hwCRC != DISABLE)
  {
    (bluedata + StateMachineNo)->BYTE34 &= ~STATEMACH_BYTE34_DISABLECRC_Msk;
  }
  else
  {
    (bluedata + StateMachineNo)->BYTE34 |= STATEMACH_BYTE34_DISABLECRC_Msk;
  }
  return;
}

/**
  * @brief  Starts tone transmission on selected channel.
  *         This API is dedicated for test and destroys context and multistate.
  *         So, after calling this function the radio should be re-initialized.
  * @param  RF_Channel: radio frequency channel number from 0 to 39.
  *         Note that RF channel index is different from ble channel index due to advertising channels,
  *         Please refer following table:
  *         RF channel 0:  2402 MHz -> ble channel index 37
  *         RF channel 1:  2404 MHz -> ble channel index 0
  *         RF channel 2:  2406 MHz -> ble channel index 1
  *         ...
  *         RF channel 11: 2424 MHz -> ble channel index 10
  *         RF channel 12: 2426 MHz -> ble channel index 38
  *         RF channel 13: 2428 MHz -> ble channel index 11
  *         RF channel 14: 2430 MHz -> ble channel index 12
  *         ...
  *         RF channel 38: 2478 MHz -> ble channel index 36
  *         RF channel 39: 2480 MHz -> ble channel index 39
  * @param  powerLevel: power level which should set.
  * @param  freq_offset: Specify if the tone must be emitted with an offset from the channel center frequency.
  *         If 0, the tone is emitted at the channel center frequency.
  *         If 1 or 2, the device will continuously emit the tone at the center
  *         frequency plus or minus 250 kHz respectively..
  * @retval None
  */
uint8_t HAL_RADIO_StartTone(uint8_t RF_Channel, uint8_t powerLevel, uint8_t freq_offset)
{
  /* Check the parameters */
  assert_param(IS_RFCHANNEL_VALID(RF_Channel));
  assert_param(IS_POWERLEVEL_VALID(powerLevel));
  assert_param(IS_FREQOFFSET_VALID(freq_offset)); /*TBR*/

  uint8_t retVal;
  uint32_t dummyTime;

  if (globalParameters.tone_start_stop_flag != 0U)
  {
    retVal = 1;
  }
  else
  {
    if ((RF_Channel >= 40U) || (freq_offset > 2U)) /*TBR*/
    {
      retVal = 1;
    }
    else
    {
      if (HAL_RADIO_GetStatus(&dummyTime) == BLUE_IDLE_0)
      {
        globalParameters.tone_start_stop_flag = 1;
        /* [EM:] Calculate the synt divide factor for 16 MHz quarts and +250 kHz offset wrt the channel center frequency
        *  Algorithmically MAK = F_rf*(2^20)/32 = F_rf*(2^15)
        *  With F_rf = (2402+2*RF_Channel)+0.25 MHz
        *  K corresponds to b19-b0  of MAK
        *  A corresponds to b22-b20 of MAK
        *  M corresponds to b27-b23 of MAK
        */
        uint32_t kHz_250_scaled = 8192; // = 0.250*2^20/32
        uint32_t MAK = ((2402UL + 2UL * RF_Channel) << 15);

