stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
        if (freq_offset == 1U)
        {
          MAK += kHz_250_scaled;
        }
        else if (freq_offset == 2U)
        {
          MAK -= kHz_250_scaled;
        }
        else
        {
        }

        uint8_t  M  = ((uint8_t)(MAK >> 23) & 0x1FU);
        uint8_t  A  = ((uint8_t)(MAK >> 20) & 0x07U);
        uint32_t K = (MAK & 0x000FFFFFUL) + 1UL;

        uint32_t MOD3_DIG_TEST = (M << 3) | (A & 0x7U);
        uint32_t MOD2_DIG_TEST = (K >> 12) & 0xFFU;
        uint32_t MOD1_DIG_TEST = (K >> 4) & 0xFFU;
        uint32_t MOD0_DIG_TEST = ((K & 0x0FU) << 4) | 0x09U;
        uint32_t RADIO_FSM_USR = ((powerLevel) << 3) | 0x06;

        RRM->RADIO_FSM_USR = RADIO_FSM_USR;
        RRM->MOD3_DIG_TST = MOD3_DIG_TEST;
        RRM->MOD2_DIG_TST = MOD2_DIG_TEST;
        RRM->MOD1_DIG_TST = MOD1_DIG_TEST;
        RRM->MOD0_DIG_TST = MOD0_DIG_TEST;

        /* Take control of the radio FSM through the test bus */
        RRM->DTB5_DIG_ENG = 0x09;
        uint32_t *rrm_udra_test = ((uint32_t *)&RRM->RRM_CTRL) + 0x01;
        *rrm_udra_test = 0x03;
        RRM->DTB5_DIG_ENG = 0x39;
        while (RRM->FSM_STATUS_DIG_OUT != 0x04);
        RRM->DTB5_DIG_ENG = 0x3B;
        retVal = 0;
      }
      else
      {
        retVal = 1;
      }
    }
  }
  return retVal;
}

/**
  * @brief  This routine stop tone transmission.
  *         This API is dedicated for test and destroys context and multistate.
  *         So, after calling this function the radio should be re-initialized.
  * @retval None
  */
uint8_t HAL_RADIO_StopTone(void)
{
  uint8_t retVal;

  if (globalParameters.tone_start_stop_flag != 0U)
  {
    globalParameters.tone_start_stop_flag = 0;
    /* Release control of the radio FSM through the test bus */
    RRM->DTB5_DIG_ENG = 0x00;
    uint32_t *rrm_udra_test = ((uint32_t *)&RRM->RRM_CTRL) + 0x01;
    *rrm_udra_test = 0x00;
    retVal = 0;
  }
  else
  {
    retVal = 1;
  }
  return retVal;
}


/**
  * @brief  Encrypts plain text data using AES encryption with given input key and
  *         128 bit block size
  * @param  Key: encryption key to be used.
  * @param  plainData: text data to be encrypted.
  * @param  cypherData: contains the encrypted data.
  * @retval None
  */
void HAL_RADIO_EncryptPlainData(uint8_t *Key, uint8_t *plainData, uint8_t *cypherData)
{
  uint32_t key[4] ;
  uint32_t cleartext[4] ;
  uint32_t ciphertext[4] ;
  volatile uint32_t ii ;

  for (uint8_t i = 0; i < 4; i++)
  {
    key[i] = ((uint32_t)Key[i * 4]) | ((uint32_t)Key[i * 4 + 1]) << 8 | ((uint32_t)Key[i * 4 + 2]) << 16 | ((uint32_t)Key[ i * 4 + 3]) << 24;
    cleartext[i] = ((uint32_t)plainData[i * 4]) | ((uint32_t)plainData[i * 4 + 1]) << 8 | ((uint32_t)plainData[i * 4 + 2]) << 16 | ((uint32_t)plainData[i * 4 + 3]) << 24;
  }

  BLUE->MANAESKEY0REG = key[3];
  BLUE->MANAESKEY1REG = key[2];
  BLUE->MANAESKEY2REG = key[1];
  BLUE->MANAESKEY3REG = key[0];

  BLUE->MANAESCLEARTEXT0REG = cleartext[3];
  BLUE->MANAESCLEARTEXT1REG = cleartext[2];
  BLUE->MANAESCLEARTEXT2REG = cleartext[1];
  BLUE->MANAESCLEARTEXT3REG = cleartext[0];

  BLUE->MANAESCMDREG = 1;

  ii = 0 ;
  while ((BLUE->MANAESSTATREG == 0) && ii < 100)
  {
    ii++;
  }

  ciphertext[0] = BLUE->MANAESCIPHERTEXT3REG;
  ciphertext[1] = BLUE->MANAESCIPHERTEXT2REG;
  ciphertext[2] = BLUE->MANAESCIPHERTEXT1REG;
  ciphertext[3] = BLUE->MANAESCIPHERTEXT0REG;

  for (uint8_t i = 0; i < 4; i++)
  {
    cypherData[i * 4] = ((uint8_t)ciphertext[i]);
    cypherData[i * 4 + 1] = (uint8_t)(ciphertext[i] >> 8);
    cypherData[i * 4 + 2] = (uint8_t)(ciphertext[i] >> 16);
    cypherData[i * 4 + 3] = (uint8_t)(ciphertext[i] >> 24);
  }

  return ;
}


/**
  * @brief  This routine sets the network ID field for packet transmission and filtering for the receiving.
  *         Only two devices with same networkID can communicate with each other.
  * @param  ID: network ID based on bluetooth specification:
  *           1. It shall have no more than six consecutive zeros or ones.
  *           2. It shall not have all four octets equal.
  *           3. It shall have no more than 24 transitions.
  *           4. It shall have a minimum of two transitions in the most significant six bits.
  *
  * @retval uint8_t: return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  */
uint8_t HAL_RADIO_SetNetworkID(uint32_t ID)
{
  networkID = ID;
  return 0;
}


/**
  * @brief  This routine sends a packet on a specific channel and at a specific time.
  * @param  channel: BLE channel index between 0 to 39.
  * @param  wakeup_time: Time of transmission in us. This is relative time regarding now.
  *         Minimum wakeup_time of 230 us. TBR
  * @param  txBuffer: Pointer to TX data buffer. Second byte of this buffer must be the length of the data.
  * @param  Callback: This function is being called as data routine.
  *         First ActionPacket is current action packet and the second one is next action packet.
  * @retval uint8_t return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  *           - 0xC4 : Radio is busy, receiving has not been triggered.
  */
uint8_t HAL_RADIO_SendPacket(uint8_t channel, uint32_t wakeup_time, uint8_t *txBuffer,
                             uint8_t (*Callback)(ActionPacket *, ActionPacket *))
{
  uint8_t returnValue = SUCCESS_0;
  uint32_t dummy;
  uint32_t time;

  time = (uint32_t)HAL_RADIO_TIMER_GetCurrentSysTime() + HAL_RADIO_TIMER_UsToSystime(wakeup_time);

  if (channel > 39)
  {
    returnValue = INVALID_PARAMETER_C0;
  }

  if (HAL_RADIO_GetStatus(&dummy) != BLUE_IDLE_0)
  {
    returnValue = RADIO_BUSY_C4;
  }

  if (returnValue == SUCCESS_0)
  {
    uint8_t map[5] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    HAL_RADIO_SetChannelMap(0, &map[0]);
    HAL_RADIO_SetChannel(0, channel, 0);
    HAL_RADIO_SetTxAttributes(0, networkID, 0x555555);

    aPacket[0].StateMachineNo = 0;
    aPacket[0].ActionTag =  TXRX | PLL_TRIG;
    aPacket[0].WakeupTime = time;
    aPacket[0].MaxReceiveLength = 0; /* does not affect for Tx */
    aPacket[0].data = txBuffer;
    aPacket[0].next_true = NULL_0;
    aPacket[0].next_false = NULL_0;
    aPacket[0].condRoutine = CondRoutineTrue;
    aPacket[0].dataRoutine = Callback;

