stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
    HAL_RADIO_SetReservedArea(&aPacket[0]);
    returnValue = HAL_RADIO_MakeActionPacketPending(&aPacket[0]);
  }

  return returnValue;
}


/**
  * @brief  This routine sends a packet on a specific channel and at a certain time then wait for receiving acknowledge.
  * @param  channel: BLE channel index between 0 to 39.
  * @param  wakeup_time: Time of transmission based on us. This is relative time regarding now.
  *         Minimum wakeup_time of 250 us. TBR
  * @param  txBuffer: Pointer to TX data buffer. Second byte of this buffer must be the length of the data.
  * @param  rxBuffer: Pointer to RX data buffer. Second byte of this buffer must be the length of the data.
  * @param  receive_timeout: Time of RX window used to wait for the packet on us.
  * @param  receive_length: number of bytes that the link layer accepts in reception.
  * @param  Callback: This function is being called as data routine.
  *         First ActionPacket is current action packet and the second one is next action packet.
  * @retval uint8_t return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  *           - 0xC4 : Radio is busy, receiving has not been triggered.
  */
uint8_t HAL_RADIO_SendPacketWithAck(uint8_t channel, uint32_t wakeup_time, uint8_t *txBuffer, uint8_t *rxBuffer,
                                    uint32_t receive_timeout,
                                    uint8_t receive_length,
                                    uint8_t (*Callback)(ActionPacket *, ActionPacket *))
{
  uint8_t returnValue = SUCCESS_0;
  uint32_t dummy;
  uint32_t time;

  time = (uint32_t)HAL_RADIO_TIMER_GetCurrentSysTime() + HAL_RADIO_TIMER_UsToSystime(wakeup_time);

  if (channel > 39)
  {
    returnValue = INVALID_PARAMETER_C0;
  }

  if (HAL_RADIO_GetStatus(&dummy) != BLUE_IDLE_0)
  {
    returnValue = RADIO_BUSY_C4;
  }

  uint8_t map[5] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU};
  HAL_RADIO_SetChannelMap(0, &map[0]);
  HAL_RADIO_SetChannel(0, channel, 0);
  HAL_RADIO_SetTxAttributes(0, networkID, 0x555555);
  HAL_RADIO_SetGlobalReceiveTimeout(receive_timeout);

  aPacket[0].StateMachineNo = 0;
  aPacket[0].ActionTag = TXRX | PLL_TRIG;
  aPacket[0].WakeupTime = time;
  aPacket[0].MaxReceiveLength = 0; /* does not affect for Tx */
  aPacket[0].data = txBuffer;
  aPacket[0].next_true = &aPacket[1];
  aPacket[0].next_false = &aPacket[1];
  aPacket[0].condRoutine = CondRoutineTrue;
  aPacket[0].dataRoutine = DataRoutineNull;

  aPacket[1].StateMachineNo = 0;
  aPacket[1].ActionTag = 0;
  aPacket[1].WakeupTime = time;
  aPacket[1].MaxReceiveLength = receive_length;
  aPacket[1].data = rxBuffer;
  aPacket[1].next_true = NULL_0;
  aPacket[1].next_false = NULL_0;
  aPacket[1].condRoutine = CondRoutineTrue;
  aPacket[1].dataRoutine = Callback;

  HAL_RADIO_SetReservedArea(&aPacket[0]);
  HAL_RADIO_SetReservedArea(&aPacket[1]);
  returnValue = HAL_RADIO_MakeActionPacketPending(&aPacket[0]);

  return returnValue;
}

#if defined (STM32WB06) || defined (STM32WB07)

static uint8_t CarrierSenseCallback(ActionPacket *p, ActionPacket *next)
{
  return TRUE;
}

/**
  * @brief  This function puts the radio in RX state to read the RSSI.
  * @note   The function uses a busy loop to wait for the RSSI value and then exits
  *         from RX state.
  * @param      channel: BLE channel index between 0 to 39.
  * @param[out] rssi: the measured RSSI value on the channel
  * @retval uint8_t return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  *           - 0xC4 : Radio is busy, receiving has not been triggered.
  */
uint8_t HAL_RADIO_CarrierSense(uint8_t channel, int8_t *rssi)
{
  uint8_t ret;
  uint16_t loop = 0;
  uint32_t *DEMOD_DIG_TST_p = (uint32_t *)0x60001564;
  uint32_t end_time;
  static uint8_t buffer[1];

  *rssi = 127;

  uint32_t networkID_tmp = networkID;

  networkID = FAKE_NETWORK_ID;

  ret = HAL_RADIO_ReceivePacket(channel, 300, buffer, 1000, sizeof(buffer), CarrierSenseCallback);

  networkID = networkID_tmp;

  if (ret)
  {
    return ret;
  }

  /* loop variable just to protect from infinite loop */
  while ((RRM->FSM_STATUS_DIG_OUT & RRM_FSM_STATUS_DIG_OUT_STATUS) != 0x1A && loop++ < 60000);
  end_time = WAKEUP->ABSOLUTE_TIME + 20;
  while (TIME_DIFF(end_time, WAKEUP->ABSOLUTE_TIME) > 0);
  *DEMOD_DIG_TST_p = 0x02;
  /* Need to wait at least 3 BLE clocks. In worst case (sysclock = 64 MHz and blesysclk = 16 MHz)
     this means 12 cpu cycles. Some cycles are already used by the call to HAL_RADIO_ReadRSSI()
     and at the beginning of the function. */
  __NOP();
  __NOP();
  __NOP();
  __NOP();
  __NOP();
  __NOP();
  __NOP();
  __NOP();
  *rssi = HAL_RADIO_ReadRSSI();
  *DEMOD_DIG_TST_p = 0x00;
  BLUE->CMDREG = BLUE_CMDREG_TXRXSKIP;

  return 0;
}

#elif defined(STM32WB05) || defined(STM32WB09 )

static volatile int8_t _rssi;
static volatile uint8_t _timeout;

static uint8_t CarrierSenseCallback(ActionPacket *p, ActionPacket *next)
{
  _rssi = 127;

  if ((p->status & BLUE_INTERRUPT1REG_DONE) && (p->status & BLUE_STATUSREG_PREVTRANSMIT) == 0 &&
      ((p->status & BLUE_INTERRUPT1REG_RCVOK) || (p->status & BLUE_INTERRUPT1REG_RCVTIMEOUT)
       || (p->status & BLUE_INTERRUPT1REG_RCVCRCERR)))
  {
    _rssi = p->rssi;
  }
  _timeout = TRUE;

  return TRUE;
}

/**
  * @brief  This function puts the radio in RX state to read the RSSI.
  * @note   The function uses a busy loop to wait for the RSSI value and then exits
  *         from RX state.
  * @param      channel: BLE channel index between 0 to 39.
  * @param[out] rssi: the measured RSSI value on the channel
  * @retval uint8_t return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  *           - 0xC4 : Radio is busy, receiving has not been triggered.
  */
uint8_t HAL_RADIO_CarrierSense(uint8_t channel, int8_t *rssi)
{
  uint8_t ret;
  uint16_t loop = 0;
  static uint8_t buffer[1];

  *rssi = 127;

  uint32_t networkID_tmp = networkID;

  networkID = FAKE_NETWORK_ID;

  _timeout = FALSE;

