stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_radio.c
  ret = HAL_RADIO_ReceivePacket(channel, 300, buffer, 5, sizeof(buffer), CarrierSenseCallback);

  networkID = networkID_tmp;

  if (ret)
  {
    return ret;
  }

  /* loop variable just to protect from infinite loop */
  while (_timeout == FALSE && loop++ < 60000);
  *rssi = _rssi;

  return 0;
}

#endif

/**
  * @brief  This routine receives a packet on a specific channel and at a certain time.
  * @param  channel: BLE channel index between 0 to 39.
  * @param  wakeup_time: Time of transmission based on us. This is relative time regarding now.
  *         Minimum wakeup_time of 230 us. TBR
  * @param  rxBuffer: Pointer to RX data buffer. Second byte of this buffer must be the length of the data.
  * @param  receive_timeout: Time of RX window used to wait for the packet on us.
  * @param  receive_length: number of bytes that the link layer accepts in reception.
  * @param  Callback: This function is being called as data routine.
  *         First ActionPacket is current action packet and the second one is next action packet.
  * @retval uint8_t return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  *           - 0xC4 : Radio is busy, receiving has not been triggered.
  */
uint8_t HAL_RADIO_ReceivePacket(uint8_t channel, uint32_t wakeup_time, uint8_t *rxBuffer, uint32_t receive_timeout,
                                uint8_t receive_length,
                                uint8_t (*Callback)(ActionPacket *, ActionPacket *))
{
  uint8_t returnValue = SUCCESS_0;
  uint32_t dummy;
  uint32_t time;
  time = (uint32_t)HAL_RADIO_TIMER_GetCurrentSysTime() + HAL_RADIO_TIMER_UsToSystime(wakeup_time);

  if (channel > 39)
  {
    returnValue = INVALID_PARAMETER_C0;
  }

  if (HAL_RADIO_GetStatus(&dummy) != BLUE_IDLE_0)
  {
    returnValue = RADIO_BUSY_C4;
  }

  if (returnValue == SUCCESS_0)
  {
    uint8_t map[5] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    HAL_RADIO_SetChannelMap(0, &map[0]);
    HAL_RADIO_SetChannel(0, channel, 0);
    HAL_RADIO_SetTxAttributes(0, networkID, 0x555555);
    HAL_RADIO_SetGlobalReceiveTimeout(receive_timeout);


    aPacket[0].StateMachineNo = 0;
    aPacket[0].ActionTag =  PLL_TRIG;
    aPacket[0].WakeupTime = time;
    aPacket[0].MaxReceiveLength = receive_length;
    aPacket[0].data = rxBuffer;
    aPacket[0].next_true = NULL_0;
    aPacket[0].next_false = NULL_0;
    aPacket[0].condRoutine = CondRoutineTrue;
    aPacket[0].dataRoutine = Callback;

    HAL_RADIO_SetReservedArea(&aPacket[0]);
    returnValue = HAL_RADIO_MakeActionPacketPending(&aPacket[0]);
  }

  return returnValue;
}

/**
  * @brief  This routine receives a packet on a specific channel and at a certain time.
  *         Then sends a packet as an acknowledgment.
  * @param  channel: BLE channel index between 0 to 39.
  * @param  wakeup_time: time of transmission based on us. This is relative time regarding now.
  *         Minimum wakeup_time of 250 us. TBR
  * @param  rxBuffer: points to received data buffer. second byte of this buffer determines the length of the data.
  * @param  txBuffer: points to data buffer to send. second byte of this buffer must be the length of the buffer.
  * @param  receive_timeout: Time of RX window used to wait for the packet on us.
  * @param  receive_length: number of bytes that the link layer accepts in reception.
  * @param  Callback: This function is being called as data routine.
  *         First ActionPacket is current action packet and the second one is next action packet.
  * @retval uint8_t return value
  *           - 0x00 : Success.
  *           - 0xC0 : Invalid parameter.
  *           - 0xC4 : Radio is busy, receiving has not been triggered.
  */
uint8_t HAL_RADIO_ReceivePacketWithAck(uint8_t channel, uint32_t wakeup_time, uint8_t *rxBuffer, uint8_t *txBuffer,
                                       uint32_t receive_timeout,
                                       uint8_t receive_length,
                                       uint8_t (*Callback)(ActionPacket *, ActionPacket *))
{
  uint8_t returnValue = SUCCESS_0;
  uint32_t dummy;
  uint32_t time;

  time = (uint32_t)HAL_RADIO_TIMER_GetCurrentSysTime() + HAL_RADIO_TIMER_UsToSystime(wakeup_time);

  if (channel > 39)
  {
    returnValue = INVALID_PARAMETER_C0;
  }

  if (HAL_RADIO_GetStatus(&dummy) != BLUE_IDLE_0)
  {
    returnValue = RADIO_BUSY_C4;
  }

  if (returnValue == SUCCESS_0)
  {
    uint8_t map[5] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0xFFU};

    HAL_RADIO_SetChannelMap(0, &map[0]);
    HAL_RADIO_SetChannel(0, channel, 0);
    HAL_RADIO_SetTxAttributes(0, networkID, 0x555555);
    HAL_RADIO_SetGlobalReceiveTimeout(receive_timeout);

    aPacket[0].StateMachineNo = 0;
    aPacket[0].ActionTag =  PLL_TRIG;
    aPacket[0].WakeupTime = time;
    aPacket[0].MaxReceiveLength = receive_length;
    aPacket[0].data = rxBuffer;
    aPacket[0].next_true = &aPacket[1];
    aPacket[0].next_false = NULL_0;
    aPacket[0].condRoutine = CondRoutineRxTrue;
    aPacket[0].dataRoutine = Callback;

    aPacket[1].StateMachineNo = 0;
    aPacket[1].ActionTag =  TXRX;
    aPacket[1].WakeupTime = time;
    aPacket[1].MaxReceiveLength = 0; /* does not affect for Tx */
    aPacket[1].data = txBuffer;
    aPacket[1].next_true = NULL_0;
    aPacket[1].next_false = NULL_0;
    aPacket[1].condRoutine = CondRoutineTrue;
    aPacket[1].dataRoutine = Callback;

    HAL_RADIO_SetReservedArea(&aPacket[0]);
    HAL_RADIO_SetReservedArea(&aPacket[1]);
    returnValue = HAL_RADIO_MakeActionPacketPending(&aPacket[0]);
  }

  return returnValue;
}

#endif /* USE_RADIO_PROPRIETARY_DRIVER */

/**
  * @brief RADIO MSP Init
  * @param  hradio pointer to a RADIO_HandleTypeDef structure that contains
  *         the configuration information for RADIO module
  * @retval None
  */
__weak void HAL_RADIO_MspInit(RADIO_HandleTypeDef *hradio)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hradio);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_I2S_MspInit could be implemented in the user file
   */
}

/**
  * @brief RADIO MSP DeInit
  * @param  hradio pointer to a RADIO_HandleTypeDef structure that contains
  *         the configuration information for RADIO module
  * @retval None
  */
__weak void HAL_RADIO_MspDeInit(RADIO_HandleTypeDef *hradio)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hradio);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_RADIO_MspDeInit could be implemented in the user file
   */
}

__weak void HAL_RADIO_TxRxCallback(uint32_t flags)
{
}


__weak void HAL_RADIO_TxRxSeqCallback(void)
{
}

void HAL_RADIO_TXRX_IRQHandler(void)
{
  uint32_t blue_status = BLUE->STATUSREG;
  uint32_t blue_interrupt = BLUE->INTERRUPT1REG;

  /** clear all pending interrupts */
  BLUE->INTERRUPT1REG = blue_interrupt;

  HAL_RADIO_TIMER_EndOfRadioActivityIsr();

#if (USE_RADIO_PROPRIETARY_DRIVER == 1)
  HAL_RADIO_ActionPacketIsr(blue_status | blue_interrupt);
#endif

  HAL_RADIO_TxRxCallback(blue_status | blue_interrupt);

  HAL_RADIO_TIMER_RadioTimerIsr();

  /* If the device is configured with
     System clock = 64 MHz and BLE clock = 16 MHz
     a register read is necessary to end fine
     the clear interrupt register operation,
     due the AHB down converter latency */
  blue_interrupt = BLUE->INTERRUPT1REG;
}


void HAL_RADIO_TXRX_SEQ_IRQHandler(void)
{
  HAL_RADIO_TxRxSeqCallback();
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
